In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [4]:
# Ensure you can run SQL commands in Jupyter notebook by running
# the following code: !pip install ipython-sql OR !conda install -yc conda-forge ipython-sql

In [5]:
# Adding %%sql will allow us to run code lines using SQL queries

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [10]:
# 1. Write a query to return information on the tables in the database.
# 2. In a different code cell, write and run another query that returns the first 5 rows of the facts table in the database.

In [9]:
%%sql
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [11]:
# 1. Write a single query that returns the:
# **Minimum population / **Maximum population
# **Minimum population growth / **Maximum population growth

In [38]:
%%sql
SELECT MIN(population), MAX(population), 
        MIN(population_growth), MAX(population_growth)
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [37]:
# 1. Write a query that returns the countrie(s) with the minimum population.
# 2. Write a query that returns the countrie(s) with the maximum population.

In [35]:
%%sql
SELECT * FROM facts WHERE population == (SELECT MIN(population) FROM facts);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [36]:
%%sql
SELECT * FROM facts WHERE population == (SELECT MAX(population) FROM facts);

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [40]:
# 1. Recompute the summary statistics you found earlier while excluding the row for the whole world.
# 2. In a different code cell, calculate the average value for the following columns: population and area

In [44]:
%%sql
SELECT MIN(population), MAX(population), 
        MIN(population_growth), MAX(population_growth)
    FROM facts WHERE name <> 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

In [55]:
%%sql
SELECT AVG(population) AS "Average Population (Excluding World Value)" from facts WHERE name <> 'World';

Done.

[(32242666.56846473,)]

In [56]:
%%sql
SELECT AVG(area) AS "Average Area (Excluding World Value)" from facts WHERE name <> 'World';

Done.

[(555093.546184739,)]

In [57]:
# Write a query that finds all countries meeting both of the following conditions:
# **The population is above average / **The area is below average.

In [ ]:
%%sql
SELECT AVG(population) AS "Average Population (Excluding World Value)" from facts WHERE name <> 'World';